//const square = require("./square");

//describe("Тестирование квадратного уравнения", () => {
//  it("Дискриминант больше нуля", () => {
//    const result = [4, -1];
//    expect(square(1, -3, -4)).toEqual(result);
//  });
//  it("Дискриминант равен нулю", () => {
//        expect(square(9, 6, 1)).toEqual(-27);
//  });
//  it("Дискриминант меньше нуля", () => {
//        expect(square(9, 6, 2)).toEqual("корней нет");
//  });
//});

//const square = require("./square");

//describe("Тестирование квадратного уравнения", () => {
//  it.each([
//    [1, -3, -4, [4, -1]],
//    [9, 6, 1, -27],
//    [9, 6, 2, "корней нет"]
//  ])("При переменных значениях %p полученные корни %p", (a, b, c, result) => {
//    expect(square(a, b, c)).toEqual(result);
//  });
//});


const square = require("./square");

describe("Тестирование квадратного уравнения литеральный синтаксис", () => {
  it.each([
    [1, -3, -4, [4, -1]],
    [9, 6, 1, -27],
    [9, 6, 2, "корней нет"]
  ])("При переменных значениях %p полученные корни %p", (a, b, c, result) => {
    expect(square(a, b, c)).toEqual(result);
  });
});
